## Concatenate

### 1. Concatenate rows of two data frames and assign keys

In [26]:
import pandas as pd
df1 = pd.DataFrame({
'ID':[101,102,103,104,105],
'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
'Subject':['Maths','English','Science','German','History']})

df2 = pd.DataFrame(
{'ID':[101,102,103,104,105],
'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
'Subject':['English','Science','Social Science','German','History']})

In [22]:
# Your code here 
pd.concat([df1, df2],ignore_index= False ,keys=['First','Second'])

           ID    Name         Subject
First  0  101    Alex           Maths
       1  102     Amy         English
       2  103   Allen         Science
       3  104   Alice          German
       4  105  Ayoung         History
Second 0  101   Billy         English
       1  102   Brian         Science
       2  103    Bran  Social Science
       3  104   Bryce          German
       4  105   Betty         History

### 2. Concatenate the two data frame and clear the existing index

In [17]:
df_1 = pd.DataFrame([['a', 1], ['b', 2]], columns=['letter', 'number']) 
df_2 = pd.DataFrame([['c', 3], ['d', 4]], columns=['letter', 'number'])

In [20]:
# Your code here 
pd.concat([df_1, df_2],ignore_index= True
         )

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [31]:
import pandas as pd
df1 = pd.DataFrame({
'ID':[101,102,103,104,105],
'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
'Subject':['Maths','English','Science','German','History']})

df2 = pd.DataFrame(
{'ID':[101,102,103,104,105],
'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
'Subject':['English','Science','Social Science','German','History']})

In [35]:
pd.merge(df1,df2, on =['ID', 'Subject'] , how='outer')

    ID  Name_x         Subject Name_y
0  101    Alex           Maths    NaN
1  102     Amy         English    NaN
2  103   Allen         Science    NaN
3  104   Alice          German  Bryce
4  105  Ayoung         History  Betty
5  101     NaN         English  Billy
6  102     NaN         Science  Brian
7  103     NaN  Social Science   Bran

In [36]:
import pandas as pd
df1 = pd.DataFrame({
'ID':[101,102],
'Name': ['Alex', 'Amy'],
'Subject':['Maths','English']})

df2 = pd.DataFrame(
{'ID':[103,104],
'Name': ['Billy', 'Brian'],
'Subject':['English','Science']})

In [40]:
pd.merge(df1,df2, on =['ID' , 'Subject'] , how='outer')

    ID Name_x  Subject Name_y
0  101   Alex    Maths    NaN
1  102    Amy  English    NaN
2  103    NaN  English  Billy
3  104    NaN  Science  Brian

In [51]:
data1={'Physics': [77, 75, 100, 10, 59], 'Chemistry': [85, 70, 99, 30, 80]}
df1=pd.DataFrame(data=data1)
data2={'Student_ID': [0, 1, 2, 3, 4], 'Maths': [80, 90, 88, 25, 90]}
df2=pd.DataFrame(data=data2)
df3=pd.concat([df1, df2], join='inner', axis=0, ignore_index=True)
df3

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [52]:
data1={'Student_ID': [3, 4, 6, 8, 10], 'CGPA': [4.5, 3, 4.37, 3.5, 4]}
df1=pd.DataFrame(data=data1)
data2={'Student_ID': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 
'Maths': [4,52, 5, 2.5, 3, 3.9, 2.8, 4.75, 3.68, 5, 4.8]}
df2=pd.DataFrame(data=data2)
df3=pd.merge(df2, df1, on='Student_ID', how='left') 
df3

    Student_ID  Maths  CGPA
0            0   4.00   NaN
1            1  52.00   NaN
2            2   5.00   NaN
3            3   2.50  4.50
4            4   3.00  3.00
5            5   3.90   NaN
6            6   2.80  4.37
7            7   4.75   NaN
8            8   3.68  3.50
9            9   5.00   NaN
10          10   4.80  4.00